# Επιλέγουμε μια ελαφριά έκδοση του Node.js (Alpine Linux)
FROM node:20-alpine

# Ορίζουμε τον φάκελο που θα δουλεύει το container εσωτερικά
WORKDIR /app

# Αντιγράφουμε τα αρχεία των ρυθμίσεων πρώτα για καλύτερο caching
COPY package*.json ./

# Εγκαθιστούμε τα πακέτα/βιβλιοθήκες της React
RUN npm install

# Αντιγράφουμε όλο τον υπόλοιπο τοπικό κώδικα μέσα στο container
COPY . .

# Ανοίγουμε την πόρτα 5173 που χρησιμοποιεί το Vite από προεπιλογή
EXPOSE 5173

# Η εντολή εκκίνησης. 
# Το "--host" είναι απολύτως απαραίτητο στο Docker για να εκτεθεί το δίκτυο 
# και να βλέπεις το site στον browser σου στο localhost.
CMD ["npm", "run", "dev", "--", "--host"]